Repository: 84000/data-translation-memory
Catalog: toh346-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཁྱིམ་བདག་གིས་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་བཻ་དཱུརྱའི་ཁང་པ་བརྩེགས་པ་ན་འདུག་སྟེ་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives seated in a pinnacled temple made of beryl your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ཆེན་པོ་ཞེས་བྱ་བ།
en: She replied, “This is the monk known as Mahākātyāyanaputra.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མདོ་སྡེ་པ་དང་བྱེ་བྲག་ཏུ་སྨྲ་བ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཻ་དཱུརྱའི་ཁང་པ་བརྩེགས་པའི་ནང་དུ་འདུག་ནས་འོང་བ་འདི་ཡིན་ནོ། །
en: The Blessed One pronounced him chief among the Sautrāntika and Vaibhāṣika teachers. It is he who arrives seated in a pinnacled temple made of beryl.

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་གསུས་པོ་ཆེས་ཁྱུ་མཆོག་གི་ཤིང་རྟ་མངོན་པར་སྤྲུལ་ནས། རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལས་འོང་ངོ་། །
en: Next, the venerable Kauṣṭhila made his entrance from the sky above using his miraculous power, having magically created a bull chariot.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་ཁྱུ་མཆོག་གི་ཤིང་རྟ་ལ་ཞོན་ཏེ་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives riding on a bull chariot your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་གསུས་པོ་ཆེ་ཞེས་བྱ་བ།
en: She replied, “This is the monk known as Kauṣṭhila.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རིག་པ་ཐོབ་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་ཁྱུ་མཆོག་གི་ཤིང་རྟས་འོང་བ་འདི་ཡིན་ནོ། །
en: The Blessed One pronounced him chief among those who have attained analytical knowledge. It is he who arrives seated on a bull chariot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་སྲུང་དབང་གི་བུ་ངང་པའི་ཤིང་རྟས་སྟེང་གི་ནམ་མཁའ་ལས་རྫུ་འཕྲུལ་གྱིས་འོང་ངོ་། །
en: Then the venerable Pilindavatsa, by means of a swan chariot, made his entrance from the sky above using his miraculous power.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་ངང་པའི་ཤིང་རྟས་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives riding a swan chariot your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་སྲུང་དབང་གི་བུ་ཞེས་བྱ་བ།
en: She replied, “This is the monk known as Pilindavatsa.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྙིང་རྗེ་ལ་གནས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་འདི་ཡིན་ཏེ།
en: The Blessed One pronounced him chief among those who abide in compassion.

source: འདི་ཆུ་བོ་གང་གཱ་རྒལ་བར་འདོད་པ་ན་དམངས་མོ་འདུག་ཤིག་ཅེས་སྨྲས་པ་དང་།
en: When he wished to cross the Ganges River, he commanded, ‘Stay, servant woman!’

source: ཚིག་དེའི་རྗེས་ཐོགས་ཉིད་ལ་རི་བོ་བརྩེགས་པ་བཞིན་དུ་གནས་ཏེ།
en: As soon as he spoke those words, she remained like a mountain peak, not flowing at all.

source: རྣམ་པ་ཐམས་ཅད་དུ་མི་འབབ་པར་བྱེད་པ་དེ་ངང་པའི་ཤིང་རྟས་འོང་བ་འདི་ཡིན་ནོ། །
en: It is he who arrives on a swan chariot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་རྣ་བ་བྱེ་བ་ཉི་ཤུ་རི་ནགས་ཀྱི་ཚོགས་ལ་འཆག་ཅིང་འདུག་པ་དེ་འཆག་བཞིན་དུ་འོང་ངོ་། །
en: Next, the venerable Koṭīviṃśakarṇa made his entrance on foot, walking in a mountain forest.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་ནགས་ཤིང་བརྒྱ་དག་གིས་ཁྱབ་པའི་ནགས་འདི་ལ་འཆག་ཅིང་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives walking in a forest that is filled with hundreds of trees your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ། འདི་ནི་དགེ་སློང་རྣ་ཅན་ཞེས་བྱ་བ་བཅོམ་ལྡན་འདས་ཀྱིས་བརྩོན་འགྲུས་རྩོམ་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ཏེ།
en: She replied, “This is the monk known as Karṇika. The Blessed One pronounced him chief among those who exert themselves in diligence.

source: འདི་སྐྱེས་པ་ཙམ་གྱིས་རྣ་བ་བྱེ་བ་ཉི་ཤུ་རི་བ་དང་བཅས་པར་སྐྱེས་པ་དང་། གང་གི་རྐང་མཐིལ་གྱི་འོག་ནས་སོར་བཞི་ཙམ་གྱི་གསེར་གྱི་སྤུ་ཡང་དག་པར་སྐྱེས་པ་དང་།
en: As soon as he was born, he possessed a worth of two hundred million chaffed grains, and from the soles of his feet sprouted golden hair four finger-breadths in length.

source: གང་འདི་དང་པོའི་ཟན་ལ་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་ཟད་པར་བྱས་པ་དང་། གང་བཅོམ་ལྡན་འདས་སྙུང་བ་དང་། མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཤོས་གཙང་ཉེ་བར་བླངས་པ་དང་། གང་གི་དྲིས་འོད་མའི་ཚལ་ཐམས་ཅད་ཀུན་དུ་གང་བ་ན། རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་མནམས་ནས་མཆོག་ཏུ་ངོ་མཚར་སྐྱེས་ཏེ།
en: He is the one on whom five hundred karṣāpaṇa coins were spent for his first cooked meal, and when the Blessed One was ill and Mahāmaudgalyāyana brought it as a food offering for him, its aroma filled the whole of the Veṇuvana, so that King Bimbisāra smelled it and was greatly amazed.

source: གང་གི་རྐང་པ་གཉིས་བཞག་པ་ཙམ་གྱིས་ས་འདི་རབ་ཏུ་གཡོས་པ་དང་།
en: He is the one who, merely setting down his two feet, caused this earth to quake.

source: གང་ཞིག་རབ་ཏུ་བྱུང་ནས་འཆག་སར་འཆག་པ་ན་དེའི་རྐང་པ་གཉིས་ལས་ཁྲག་བྱུང་བ་ཟགས་པ་ཁྭ་རྣམས་འཐུང་བ་དེ་འཆག་ཅིང་འོང་བ་འདི་ཡིན་ནོ། །
en: He is the one, after he became a renunciant and stepped onto the meditation walkway, from whose two feet blood flowed and was drunk by crows. It is he who arrives on foot.”

source: བར་སྐབས་དེར་ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་འཛིན་འཁོར་ལོས་སྒྱུར་བའི་ཆ་ལུགས་སུ་མངོན་པར་སྤྲུལ་ཏེ་འོང་བ་དང་།
en: Then the venerable Rāhula made his entrance, having magically created the appearance of a universal monarch.

source: དེ་ནས་ཁྱིམ་བདག་དེས་དྲིས་པ། མ་ག་དྷཱ་བཟང་མོ་གང་འཁོར་ལོས་སྒྱུར་བའི་ཆ་བྱད་ཀྱིས་འོང་བ་འདི་ཁྱོད་ཀྱི་སྟོན་པ་དེ་ཡིན་ནམ།
en: The master of the house asked, “Sumāgadhā, is this one who arrives in the image of a universal monarch your teacher?”

source: དེས་དེ་ལ་སྨྲས་པ།
en: She replied, “This is the son of the Blessed One.

source: འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྲས་བཅོམ་ལྡན་འདས་ཀྱིས་བསླབ་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ཏེ།
en: The Blessed One pronounced him chief among those who hold the precepts.

source: འདིས་ཡབ་ཀྱིས་སྤངས་པའི་དཔལ་སྟོན་པར་བྱེད་ཅིང་འཁོར་ལོས་སྒྱུར་བའི་ཆ་ལུགས་ཀྱིས་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་བུ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ།
en: He gloriously demonstrates what was relinquished by his father, and in the appearance of a universal monarch he is possessed of the seven treasures and surrounded by thousands of youths.

source: གཟའ་དང་རྒྱུ་སྐར་དང་སྐར་མའི་ཚོགས་ཀྱིས་བསྐོར་བའི་ཟླ་བ་ལྟ་བུ་དང་། རྒྱལ་པོའི་ལམ་བཟུང་ནས་འགྲོ་བ་མིའི་བདག་པོ་ལྟ་བུ་དང་། ཆུ་བོ་སྟོང་ཕྲག་གི་ཆུ་འབབ་པས་ཀུན་ཏུ་འགེངས་པའི་རྒྱ་མཚོ་ལྟ་བུ་དང་། འཇིགས་པ་དང་ནད་དང་མྱ་ངན་སེལ་བའི་སྐྱེ་དགུ་སྐྱོང་བ་ཆེན་པོ་ལྟ་བུ་དང་། རི་དགས་ཀྱི་ནང་ན་སེང་གེ་ལྟ་བུ་དང་། བྱ་རྣམས་ཀྱི་ནང་ན་ནམ་མཁའ་ལྡིང་ལྟ་བུ་དང་།
en: He is the one who arrives like the moon surrounded by a host of planets, constellations, and stars; like a lord of humans who has entered the royal road; like an ocean filled by the cascading of a thousand rivers; like a great protector of beings who dispels fear, illness, and misery; like a lion among beasts; like a garuḍa among birds; like the all-clearing sun; and like a universal monarch ruling the four continents.

source: ཐམས་ཅད་སེལ་བའི་ཉི་མ་དང་། གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བ་དང་། ཆོས་བཟང་ན་མིག་སྟོང་ལྡན་པ་ཆོས་སྐྱོང་བ་ལྟ་བུར་འོང་བ་ཡིན་ནོ། །
en: It is he who arrives like the thousand-eyed protector of the Dharma in the assembly hall of Sudharma.”

source: དེ་བཞིན་དུ་ལ་ལ་ནི་འབར་བར་བྱེད་པ་དང་། ལ་ལ་ནི་ཆར་འབེབས་པ་དང་། དེ་བཞིན་དུ་ཆོ་འཕྲུལ་སྣ་ཚོགས་པ་སྟོན་ཅིང་འོང་བ་ཡིན་ནོ། །
en: Likewise, the others made their entrances demonstrating a variety of miraculous displays—some displaying a blaze of fire, some a shower of rain.

source: ལ་ལ་ས་ལས་འཕགས་པ་དང་། །ལ་ལ་ནམ་མཁའི་གཞི་ལ་གནས། །ལ་ལ་སྟན་ནི་སྤྲུལ་བྱེད་དེ། །
en: Some rose up from the earth, some rested on the foundation of the sky, and some created seats.

source: རྫུ་འཕྲུལ་ལྡན་པའི་མཐུ་ལ་ལྟོས། །
en: Behold the might of those possessing miraculous power!

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་སློབ་མ་རྣམས་ཡང་དག་པར་སོང་བ་དང་།
en: This is how the disciples of the Blessed One went.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་གང་གིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་གསེར་བཙོ་མའི་མདོག་འདྲ་བའི་འོད་ཀྱིས་གང་བ་དེ་ལྟ་བུའི་འོད་བཀྱེ་ཞིང་།
en: Then the Blessed One emitted a light by which all of Jambudvīpa was filled with light the color of refined gold.

source: མཉན་ཡོད་ནས་བརྩམས་ཏེ་བུ་རམ་ཤིང་འཕེལ་གྱི་བར་འདིར་འོད་ཀྱི་དཀྱིལ་འཁོར་ཆེན་པོ་བཀྱེ་བས་གང་དུའང་མིག་གིས་མི་མཐོང་བ་མེད་པས་ཐམས་ཅད་ཀྱིས་མཐོང་བར་གྱུར་ཏོ། །
en: By sending forth a great mass of light from Śrāvastī all the way to Puṇḍravardhana, nowhere was there anything that could not be seen by the eyes; thus was there total visibility.

source: བཅོམ་ལྡན་འདས་ཀྱང་ནམ་མཁའ་ལ་གཤེགས་པ་དང་། ལག་ན་རྡོ་རྗེ་ནི་སྣམ་ལོགས་ནས་འགྲེང་ངོ་། །གནས་གཙང་མ་པ་རྣམས་ནི་སྟེང་ནས་སོ། །འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ནི་འོག་ནས་སོ། །གཡོན་ལོགས་ནས་ནི་བརྒྱ་བྱིན་ནོ། །གཡས་ནས་ནི་ཚངས་པའོ། །
en: The Blessed One too proceeded through the sky, with Vajrapāṇi following behind him, the residents of Śuddhāvāsa above, the gods of the desire realm below, Śakra on the left, and Brahmā on the right.

source: དེ་བཞིན་དུ་གཙུག་ཕུད་ལྔ་པ་དང་། ཤིན་ཏུ་དགའ་དང་མིག་སྦྱིན་ལ་སོགས་པ་དྲི་ཟ་རྣམས་པི་བང་དང་གླིང་བུ་དང་རྔ་དང་རྫ་རྔ་ལ་སོགས་པ་རོལ་མོའི་བྱེ་བྲག་སྙན་པ་རྣམས་རྡུང་ཞིང་། མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་།
en: Likewise, gandharvas such as Pañcaśikha, Supriya, and Eye Gift traveled in great numbers, playing pleasant, diverse melodies on lutes, flutes, paṇava drums, clay drums, and the like, and strewing flowers, incense, perfumes, and garlands.

source: ཕྲེང་བ་རྣམས་ཀྱང་འཐོར་ཞིང་འབྱོར་པ་ཆེན་པོས་གཤེགས་ཏེ། བར་སྐབས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་སྲོག་ཆགས་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བདུན་བདེན་པ་ལ་ཐོག་མར་རབ་ཏུ་བཀོད་པར་མཛད་ནས་དེའི་འོག་ཏུ་བུ་རམ་ཤིང་འཕེལ་གྱི་གྲོང་ཁྱེར་དུ་གཤེགས་ཏེ།
en: Meanwhile, the Blessed One established seventy-seven thousand beings in the truth for the first time and, having done so, he arrived at the city of Puṇḍravardhana.

source: གྲོང་ཁྱེར་དེ་ན་ཡང་སྒོ་བཅྭ་བརྒྱད་ཡོད་པ་དང་། དེར་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་བཅྭ་བརྒྱད་སྤྲུལ་པར་མཛད་ནས་སྒོ་རེ་རེ་ཞིང་སངས་རྒྱས་སྣང་བར་གྱུར་པ་ནས་བཅོམ་ལྡན་འདས་མ་ག་དྷཱ་བཟང་མོའི་ཁྱིམ་དུ་གཤེགས་སོ། །
en: The city had eighteen gates, at which the Blessed One emanated eighteen buddhas, a buddha appearing at each of the gates. Then the Blessed One arrived at Sumāgadhā’s house.

source: དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མ་མཐོང་སྟེ། དེ་རྣམས་ཁྲོས་ནས་དེའི་ཁྱིམ་བཤིག་པར་བརྩམས་སོ། །
en: Since they could not see the blessed Buddha, the great crowd of people became angry and started to break down the house.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གྲོང་ཁྱེར་དེ་ཐམས་ཅད་ཤེལ་གྱི་རང་བཞིན་དུ་བྱིན་གྱིས་བརླབས་ཏེ། གང་ཁྱིམ་ཐམས་ཅད་དུའང་སངས་རྒྱས་ཀྱི་སྐུ་བཞུགས་པར་མཐོང་བར་མཛད་དོ། །
en: So, the Blessed One used his intention to transform the entire city into crystal, so that the body of the Buddha could be seen seated within each and every house.

source: ཇི་སྲིད་བུ་རམ་ཤིང་འཕེལ་དུ་མ་ག་དྷཱ་བཟང་མོ་ལ་སོགས་པའི་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་དྲི་དང་། ཕྲེང་བ་དང་། སྤོས་རྣམས་ཀྱིས་མཆོད་པ་བྱས་སོ། །
en: Sumāgadhā and many hundreds of thousands of other beings in Puṇḍravardhana then offered flowers, perfumes, garlands, and incense to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་མ་ག་དྷཱ་བཟང་མོ་ལ་སོགས་པའི་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་རྣམས་ལ་གང་ཞིག་ཐོས་ན་མ་ག་དྷཱ་བཟང་མོ་ལ་སོགས་པའི་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱིས་བདེན་པ་མངོན་དུ་མཐོང་བ་ཐོབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་ཆོས་བསྟན་པ་མཛད་ཅིང་།
en: The Blessed One taught the Dharma to Sumāgadhā and the rest of the great gathering of people in such a way that those who heard it—Sumāgadhā and the many hundreds and thousands of other beings—obtained the direct vision of the truth.

source: འཁོར་དེ་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ལ་གཞོལ་བ་དང་། ཆོས་ལ་བབ་པ་དང་། དགེ་འདུན་ལ་འབབ་པར་གྱུར་ཏོ། །
en: The entire assembly became inclined toward the Buddha, disposed to the Dharma, and favorable toward the Saṅgha.

source: ཡང་དགེ་སློང་རྣམས་ཐེ་ཙོམ་སྐྱེས་ཏེ། ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པར་མཛད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཅོམ་ལྡན་འདས་ཇི་སྲིད་དུ་མ་ག་དྷཱ་བཟང་མོ་མཆིས་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་མཐོ་རིས་དང་ཐར་པ་ལ་གཞོལ་བར་གྱུར་པ་དང་། འདིས་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིས་པ་ནི་ངོ་མཚར་ཆེའོ། །
en: Yet, the monks were perplexed, and to ease all their uncertainty, they addressed the Blessed One: “Blessed One, it is wondrous how by Sumāgadhā’s going to the other side, many hundreds of thousands of beings have become inclined toward the higher realms and toward liberation, and that by this she has accomplished buddha activity.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟ་འབའ་ཞིག་ཏུ་མ་ཟད་དེ། འདས་པའི་དུས་ན་འདིས་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་པ་དེ་ཉོན་ཅིག །
en: The Blessed One replied, “Listen to how she accomplished buddha activity, not only at present but in the past, too.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཞེས་བྱ་བ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: Monks, in ancient times, long ago, when the lifespan of humans was twenty thousand years, the perfectly complete buddha known as Kāśyapa, one endowed with perfect knowledge and conduct, a well-gone one, a knower of the world, an unsurpassed charioteer who tames beings, a teacher of gods and humans, a blessed buddha, emerged in the world.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ། ཡང་དུས་དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཀྲྀ་ཀཱི་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: At that time, a king known as Kṛkin ruled the city of Vārāṇasī.

source: དེའི་བུ་མོ་གསེར་གྱི་ཕྲེང་བ་དང་ལྡན་པ་ཞིག་བཙས་ཏེ། དེའི་མིང་ཡང་གསེར་ཕྲེང་ཅན་ཞེས་བྱ་བར་བཏགས་སོ། །
en: His daughter was born with a golden garland, and so they named her Kāñcanamālā.

source: ཇི་སྲིད་ཅིག་ན་བུ་མོ་དེ་ཆེར་སྐྱེས་པར་གྱུར་པ་དང་ན་ཟླ་གཞོན་ནུ་མ་ལྔ་བརྒྱ་ཐམས་ཅད་ཀྱང་གཞོན་ནུ་མས་བསྐོར་ཅིང་ཐབས་ཅིག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་བསྙེན་བཀུར་བྱེད་དེ།
en: “Later, when the girl had grown up, she went together with a retinue of young ladies, in all five hundred young girls of the same age, to pay her respects to the perfectly complete Buddha Kāśyapa.

source: དེ་ལ་དད་པ་ཡང་དག་པར་ཐོབ་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ལ་ཇི་སྲིད་འཚོའི་བར་དུ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་གཟིམས་ཆ་དང་སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱེད་དོ། །
en: Because they had faith in him, for as long as they lived they continued to serve that perfectly complete buddha, the blessed Kāśyapa, providing him with robes, alms, food, bedding, medicines for curing illness, and other necessities.

source: ཡང་དུས་དེའི་ཚེ་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་མཚན་གཅིག་ལ་རྨི་ལམ་བཅུ་རྨིས་ཏེ། དེས་སྨྲས་པ། གླང་པོ་ཆེའི་རྒྱལ་པོ་སྐར་ཁུང་ནས་བྱུང་བ་ན་མཇུག་མ་ཕྲ་མོ་ཐོགས་པ་དང་། སྐོམ་པའི་ཕྱི་ནས་ཁྲོན་པ་སྙེགས་པར་རྨི་བ་དང་། ཕྱེ་བྲེ་གང་དང་མུ་ཏིག་བྲེ་གང་ཚོང་བྱེད་པ་དང་། ཙན་དན་དང་ཤིང་རིན་མཉམ་པར་བྱེད་པ་དང་། ཀུན་དགའ་ར་བ་མེ་ཏོག་དང་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་མ་བྱིན་པར་ལེན་པ་རྣམས་ཀྱིས་ཕྲོགས་པ་དང་།
en: “During that time, one night, King Kṛkin dreamed ten dreams.

source: གླང་པོ་ཆེ་ཕྲུ་གུས་སྤོས་ཀྱི་གླང་པོ་འཇིགས་པར་བྱེད་པ་དང་། སྤྲེའུ་མི་གཙང་བས་གོས་པས་གཞན་ལ་སྐུད་པ་དང་། སྤྲེའུ་རྒྱལ་པོར་དབང་བསྐུར་བར་མཐོང་བ་དང་། རས་གཅིག་མི་བཅྭ་བརྒྱད་ཀྱིས་དྲས་ཀྱང་མ་རལ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་གཅིག་ཏུ་འདུས་ནས་འཐབ་པ་དང་།
en: As he recalled, ‘I dreamed of a king of elephants who, emerging from a window, was caught by its thin tail; I dreamed of hastening to a well when no longer thirsty; I saw the sale of a measure of pearls for a measure of flour; I saw sandalwood and ordinary wood being given equal value; I saw thieves stealing sumptuous fruits from a garden; I saw an elephant calf scaring a rutting elephant; I saw a dirty monkey smearing others with filth; I saw a monkey who was consecrated as king; I saw a piece of cloth not being torn though it was pulled by eighteen men; and I saw a great crowd of people assembled together who passed the time quarreling, arguing, fighting, and criticizing one another.’

source: རྩོད་པ་དང་གཡུལ་འགྱེད་པ་དང་མཚང་འདྲུ་བར་གྱུར་པས་འཇིགས་པ་མཐོང་ངོ་། །དེ་ནས་རྒྱལ་པོ་དེ་སད་པ་དང་འཇིགས་ཤིང་སྐྲག་ལ་སྐྱོ་བས་ངའི་འཚོ་བའི་སྲོག་གི་བར་ཆད་དུ་གྱུར་པའམ། རྒྱལ་སྲིད་ལས་ཉམས་པར་མི་འགྱུར་རམ་སྙམ་སྟེ།
en: “Then the king awoke, distraught with fear and apprehension, thinking, ‘Has my life been threatened, or am I to fall from power?’

source: དེས་བྲམ་ཟེ་རྨི་ལྟས་ཀྱི་མཚན་མ་སྟོན་ཤེས་པ་རྣམས་བསྡུས་ནས་དེ་རྣམས་ལ་རྨི་ལམ་དེ་རྣམས་སྨྲས་སོ། །
en: So he gathered some brahmins who were learned in the interpretation of dream signs, and he described his dreams to them.

source: དེ་རྣམས་ཀྱང་གསེར་ཕྲེང་ཅན་ལ་ཞེ་སྡང་བ་ཡིན་པས་དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཁྱེད་ལ་ཐམས་ཅད་ཀྱི་ནང་ན་ཐུགས་སུ་བྱོན་པ་དེའི་སྙིང་དང་མེ་ལ་སྦྱིན་སྲེག་གི་མཆོད་སྦྱིན་མཛོད་ཅིག །
en: “However, because the brahmins despised Kāñcanamālā, they said, ‘Your Majesty, you must make a sacrificial offering to the fire with the heart of the one who is most dear to you of all.’

source: དེ་ནས་རྒྱལ་པོ་དེ་ཡི་མུག་པས་བསམས་པ། ཐམས་ཅད་ཀྱི་ནང་ན་ང་ལ་སྡུག་པ་ནི་ངའི་གསེར་ཕྲེང་ཅན་ཡིན་ནོ། །
en: “In despair, the king thought, ‘The one who is to me the sweetest of all is my Kāñcanamālā!’

source: གསེར་ཕྲེང་ཅན་གྱིས་དེ་ཐོས་པ་དང་། དེ་ཡང་མཁས་པ་ཡིན་པས་རྒྱལ་པོ་དེའི་གན་དུ་སོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ།
en: “Kāñcanamālā heard about this, and since she was learned, she approached the king.

source: ལྷ་ཉི་མ་ཤར་ན་སྒྲོན་མ་མེའི་འོད་དགོས་པ་ཅི་མཆིས།
en: ‘Your Majesty, when the sun is shining, what need is there for the flame of a lamp?

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་འདི་དྲང་སྲོང་སྨྲ་བ་རི་དགས་རྒྱུ་བ་ན་བཞུགས་ཏེ་དེར་གཤེགས་ལ་ཞུས་ཤིག་དང་།
en: The perfectly complete Buddha, the blessed Kāśyapa, is dwelling at the Ṛṣivadana in Deer Park—you should go there and ask him.

source: བཅོམ་ལྡན་འདས་དེས་ཁྱེད་ལ་ཇི་ལྟར་ལུང་བསྟན་པ་དེ་བཞིན་དུ་ཁྱེད་ཀྱིས་ཟུང་ཤིག །
en: That blessed one will give you an accurate prophecy, to which you should adhere.’

source: དེ་ནས་རྒྱལ་པོ་ཀྲྀ་ཀཱིས་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་ང་དེང་བཅོམ་ལྡན་འདས་དེའི་དྲུང་དུ་འགྲོའོ་ཞེས་དྲིལ་ཆེན་པོ་བསྒྲགས་ནས་དེ་འཁོར་བརྒྱ་སྟོང་དུ་མ་དང་། གསེར་ཕྲེང་ཅན་དེ་དང་ཐབས་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Then King Kṛkin sounded a great gong and announced, ‘Now I will go to the city of Vārāṇasī, to the presence of that blessed one,’ and together with Kāñcanamālā and a retinue of many hundreds of thousands, he went to where the Blessed One was.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: There, they bowed their heads to the feet of the Blessed One and sat before the Blessed One in order to listen to the Dharma.

source: ཇི་སྲིད་ཅིག་ན་རྒྱལ་པོ་ཀྲྀ་ཀཱི་སྟན་ལས་ལངས་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: “After some time, King Kṛkin rose from his seat and approached the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདིར་དགུང་གཅིག་ལ་བདག་གིས་རྨི་ལམ་བཅུ་ཁུམས་པ།
en: He bowed with his hands folded and told the Blessed One, ‘O Blessed One, in a single night I witnessed ten dreams.

source: གླང་པོ་ཆེ་སྐར་ཁུང་ནས་བྱུང་བ་ན། དེའི་མཇུག་མ་ཐོགས་པ་ལ་སོགས་པ་སྔ་མ་བཞིན་ཏེ།
en: An elephant, emerging from a window, was caught by its tail…’ and so forth as before.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྨི་ལམ་དེའི་འབྲས་བུ་འདིར་བདག་ལ་ལུང་བསྟན་དུ་གསོལ།
en: ‘Please, Blessed One, tell me the portent of these dreams.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་མ་འཇིགས་ཤིག །
en: “The Blessed One replied, ‘Be not afraid, Great King.

source: ཁྱོད་ཀྱི་ཡུལ་འཁོར་ཉམས་པར་མི་འགྱུར་ལ། སྲོག་གི་བར་ཆད་དུ་ཡང་མི་འགྱུར་གྱིས།
en: Your kingdom will not decline, and your life is not in danger.

source: རྒྱལ་པོ་ཆེན་པོ་གཞན་དུ་ན་མ་འོངས་པའི་ཚེ་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྱུང་སྟེ། དེའི་ཕྱི་མའི་དུས་ན་ཉན་ཐོས་རྣམས་ལུས་མ་བསྡམས་པ། སེམས་མ་བསྡམས་པ། ཚུལ་ཁྲིམས་མ་བསྡམས་པ། ཤེས་རབ་མ་བསྡམས་པ་འབྱུང་བར་འགྱུར་ཏེ།
en: On the contrary, Great King, in the future, when the lifespan of humans is one hundred years, a perfectly complete buddha known as Śākyamuni will appear, and in the latter part of that time there will emerge śrāvakas whose bodies are unrestrained, whose minds are unrestrained, whose moral discipline is unrestrained, and whose wisdom is unrestrained.

source: དེ་རྣམས་གཉེན་གྱི་ཚོགས་སྤངས་ནས་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཏེ། དེ་ནས་གཙུག་ལག་ཁང་རྣམས་སུ་ཁྱིམ་གྱི་འདུ་ཤེས་འཇོག་པས་ཆགས་པར་འགྱུར་ཏེ།
en: They will abandon their kin and become renunciants, yet by engaging the notion of the household while in monasteries, they will still be attached.

source: གླང་པོ་ཆེ་སྐར་ཁུང་ནས་བྱུང་བ་ན་དེའི་མཇུག་མ་ཐོགས་པ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: The elephant being caught by its tail when emerging from a window is a premonition of that.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྐོམ་པའི་ཕྱི་ནས་ཁྲོན་པ་སྙེགས་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་རྣམས་གཙུག་ལག་ཁང་གི་ནང་ན་ལྷན་ཅིག་གནས་པ་རྣམས་ལ་ཆོས་སྟོན་པར་འགྱུར་ཡང་དེ་རྣམས་ཉན་པར་འདོད་པར་མི་བྱེད་ཅིང་ཡིད་ལ་མི་འཇོག་སྟེ། དེའི་སྔ་ལྟས་ནི་འདི་ཡིན་ནོ། །
en: “ ‘Great King, your dream of hastening to a well when no longer thirsty is a premonition that although the Dharma will be taught to those who assemble together in a monastery, they will not desire to listen, nor will they keep those teachings in mind.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཕྱེ་བྲེ་གང་དང་མུ་ཏིག་བྲེ་གང་ཚོང་བྱེད་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ཉིད་ཀྱི་ཉན་ཐོས་རྣམས་ཏེ། གང་བཟའ་བ་ཙམ་གྱི་དོན་དུ་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་པོ་ཆེ་རྣམས་ཡང་དག་པར་སྟོན་པར་འབྱུང་བར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ནི་འདི་ཡིན་ནོ། །
en: “ ‘Great King, your dream of the sale of a measure of pearls for a measure of flour is a premonition that there will emerge śrāvakas who will correctly teach the faculties, powers, and precious branches of awakening merely for the sake of food.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཙན་དན་དང་ཤིང་མཉམ་པོར་ཚོང་བྱེད་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ཉིད་ཀྱི་ཉན་ཐོས་རྣམས་མུ་སྟེགས་ཀྱི་ཚིག་གང་ཡིན་པ་རྣམས་བཟུང་ནས་སངས་རྒྱས་ཀྱི་བཀའ་དང་སྙོམས་པ་འབྱུང་བར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ནི་འདི་ཡིན་ནོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཀུན་དགའ་ར་བ་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་མ་བྱིན་པར་ལེན་པ་རྣམས་ཀྱིས་ཕྲོགས་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ཉིད་ཀྱི་ཉན་ཐོས་ལུས་མ་བསྡམས་པ།
en: “ ‘Great King, your dream of sandalwood and ordinary wood being given equal value is a premonition that there will emerge śrāvakas who, apprehending the words of non-Buddhists, will equate them with the words of the Buddha.

source: སེམས་མ་བསྡམས་པ། ཚུལ་ཁྲིམས་མ་བསྡམས་པ། ཤེས་རབ་མ་བསྡམས་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་རྣམས་དགེ་འདུན་རྣམས་ཀྱི་མེ་ཏོག་གི་མཆོག་དང་། འབྲས་བུའི་མཆོག་རྣམས་འཚོ་བའི་ཕྱིར་དགེ་འདུན་ལས་བཅད་ནས་ཁྱིམ་པ་རྣམས་ལ་སྟེར་བར་འགྱུར་ཏེ།
en: “ ‘Great King, your dream of thieves stealing sumptuous fruits from a garden is a premonition that there will emerge śrāvakas whose bodies are unrestrained, whose minds are unrestrained, whose moral discipline is unrestrained, and whose wisdom is unrestrained, and that they will take the best flowers and fruits of the saṅgha and give them to householders for the purpose of their livelihood.

source: དེའི་སྔ་ལྟས་ནི་འདི་ཡིན་ནོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་གླང་པོ་ཕྲུ་གུས་སྤོས་ཀྱི་གླང་པོ་འཇིགས་པར་བྱེད་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་འདི་ནི་དེ་ཉིད་ཀྱི་ཉན་ཐོས་རྣམས་ཚུལ་ཁྲིམས་འཆལ་བ། སྡིག་པའི་ཆོས་ཅན་དེ་རྣམས་གང་དགེ་སློང་ཚུལ་ཁྲིམས་དང་ལྡན་པ། དགེ་བའི་ཆོས་ཅན་རྣམས་ཟིལ་གྱིས་གནོན་པར་བྱེད་པར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “ ‘Great King, your dream of an elephant calf scaring a rutting elephant is a premonition that śrāvakas who have faulty moral discipline and are possessed of sinful propensities will overpower monks who possess moral discipline and virtuous propensities.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྤྲེའུ་མི་གཙང་བས་གོས་པས་གཞན་ལ་སྐུད་པར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་འདི་ནི་དེ་ཉིད་ཀྱི་ཉན་ཐོས་ཚུལ་ཁྲིམས་འཆལ་བ། སྡིག་པའི་ཆོས་ཅན་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་རྣམས་ཀྱིས་ཚུལ་ཁྲིམས་དང་ལྡན་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “ ‘Great King, your dream of a dirty monkey smearing others with filth is a premonition that there will emerge śrāvakas who have faulty moral discipline and are possessed of sinful propensities and that they will deprecate those who possess moral discipline.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྤྲེའུ་རྒྱལ་པོར་དབང་བསྐུར་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དུས་དེའི་ཚེ་རྨོངས་པ་རྣམས་རྒྱལ་པོར་དབང་བསྐུར་བར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “ ‘Great King, your dream of a monkey who was consecrated as king is a premonition that at that time deluded ones will be consecrated as kings.
